Filter

In [2]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                'degisken1':[10,23,33,22,11,99],
                'degisken2':[100,253,333,262,111,959]},
               columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        959

In [6]:
def filter_func(x):
    return x["degisken1"].std()>9

In [8]:
df.groupby("gruplar").filter(filter_func)#degişken1 e göre standart sapma hesaplandı ve 9 dan buyuk olan tabloya yazıldı.

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        959